# an zhao guanfang api lai ceshi

In [1]:
sc.master

'local[*]'

In [2]:
data=sc.textFile('file:/usr/local/spark/examples/src/main/resources/people.txt')

In [11]:
parts=data.map(lambda x:x.split(','))
parts.take(3)

[['Michael', ' 29'], ['Andy', ' 30'], ['Justin', ' 19']]

In [13]:
people=parts.map(lambda x:[x[0],x[1].strip()])
people.take(3)

[['Michael', '29'], ['Andy', '30'], ['Justin', '19']]

In [19]:
from pyspark.sql.types import StructField,StringType,StructType
SchemaString='name age'
fields = [StructField(field_name, StringType(), True) for field_name in SchemaString.split()]
schema = StructType(fields)

In [21]:
schemapeople=spark.createDataFrame(people,schema)
schemapeople.show()

+-------+---+
|   name|age|
+-------+---+
|Michael| 29|
|   Andy| 30|
| Justin| 19|
+-------+---+

In [22]:
schemapeople.registerTempTable('people')

In [25]:
result=sqlContext.sql('select * from people').show()

+-------+---+
|   name|age|
+-------+---+
|Michael| 29|
|   Andy| 30|
| Justin| 19|
+-------+---+

In [31]:
schemapeople.rdd.map(lambda x:x[1]+'1').take(5)

['291', '301', '191']

In [34]:

from pyspark.sql import Row

# spark is from the previous example.
# Create a simple DataFrame, stored into a partition directory
sc = spark.sparkContext

squaresDF = spark.createDataFrame(sc.parallelize(range(1, 6))
                                  .map(lambda i: Row(single=i, double=i ** 2)))
squaresDF.write.parquet("data/test_table/key=1")
squaresDF.show(10)
# Create another DataFrame in a new partition directory,
# adding a new column and dropping an existing column
cubesDF = spark.createDataFrame(sc.parallelize(range(6, 11))
                                .map(lambda i: Row(single=i, triple=i ** 3)))
cubesDF.write.parquet("data/test_table/key=2")

# Read the partitioned table
mergedDF = spark.read.option("mergeSchema", "true").parquet("data/test_table")
mergedDF.printSchema()
mergedDF.show(10)

+------+------+
|double|single|
+------+------+
|     1|     1|
|     4|     2|
|     9|     3|
|    16|     4|
|    25|     5|
+------+------+

root
 |-- double: long (nullable = true)
 |-- single: long (nullable = true)
 |-- triple: long (nullable = true)
 |-- key: integer (nullable = true)

+------+------+------+---+
|double|single|triple|key|
+------+------+------+---+
|  null|     6|   216|  2|
|  null|     7|   343|  2|
|  null|     8|   512|  2|
|  null|     9|   729|  2|
|  null|    10|  1000|  2|
|     1|     1|  null|  1|
|     4|     2|  null|  1|
|     9|     3|  null|  1|
|    16|     4|  null|  1|
|    25|     5|  null|  1|
+------+------+------+---+

In [2]:
PATH='hdfs://matrix:9000/user/hive/warehouse/myhive.db/test01'

In [3]:
data=sc.textFile(PATH)
data.take(5)

['name\t1\t1000\tbeijing', 'user\t2\t5000\tshanghai']

In [2]:
from pyspark.sql import HiveContext

In [3]:
sqlContext=HiveContext(sc)

In [4]:
sqlContext.sql('show databases').show()

+------------+
|databaseName|
+------------+
|     default|
|      myhive|
|        test|
+------------+

In [5]:
sqlContext.sql('use myhive').show()

++
||
++
++

In [6]:
sqlContext.sql('show tables').show()

+--------+---------+-----------+
|database|tableName|isTemporary|
+--------+---------+-----------+
|  myhive|   test02|      false|
+--------+---------+-----------+

In [7]:
sqlContext.sql('select * from myhive.test02').show()

+----+---+------+--------+
|name| id|salary|    city|
+----+---+------+--------+
|name|  1|  1000| beijing|
|user|  2|  5000|shanghai|
+----+---+------+--------+

In [10]:
import pymysql
 
# 打开数据库连接
db = pymysql.connect("localhost","root","123456","dbtest" )
# 使用 cursor() 方法创建一个游标对象 cursor
cursor = db.cursor()
# 使用 execute()  方法执行 SQL 查询 
cursor.execute("show tables")
# 使用 fetchone() 方法获取单条数据.
data = cursor.fetchone()
print ("Database version : %s " % data)
# 关闭数据库连接
db.close()

Database version : 5.7.22-0ubuntu0.17.10.1

In [11]:
import pymysql 
# 打开数据库连接
db = pymysql.connect("localhost","root","123456","dbtest" ) 
# 使用 cursor() 方法创建一个游标对象 cursor
cursor = db.cursor() 
# 使用 execute() 方法执行 SQL，如果表存在则删除
cursor.execute("DROP TABLE IF EXISTS EMPLOYEE") 
# 使用预处理语句创建表
sql = """CREATE TABLE EMPLOYEE (
         name  CHAR(20) NOT NULL,
         id INT,  
         salary int,
         city varchar(20) )""" 
cursor.execute(sql) 
# 关闭数据库连接
db.close()

/home/neo/anaconda3/lib/python3.5/site-packages/pymysql/cursors.py:170: Warning: (1051, "Unknown table 'dbtest.EMPLOYEE'")
  result = self._query(query)

In [19]:
import pymysql 
# 打开数据库连接
db = pymysql.connect("localhost","root","123456","dbtest" ) 
# 使用 cursor() 方法创建一个游标对象 cursor
cursor = db.cursor() 
# SQL 插入语句
sql = """INSERT INTO EMPLOYEE(name,
         id, salary, city)
         VALUES ('fff', 4, 3000, 'hebei')"""
try:
   # 执行sql语句
   cursor.execute(sql)
   # 提交到数据库执行
   db.commit()
except:
    
   # 如果发生错误则回滚
    db.rollback()
    
    print('shibai')
 
# 关闭数据库连接
db.close()

In [21]:
# 打开数据库连接
db = pymysql.connect("localhost","root","123456","dbtest" )
 
# 使用cursor()方法获取操作游标 
cursor = db.cursor()
 
# SQL 查询语句
sql = "SELECT * FROM EMPLOYEE"
try:
   # 执行SQL语句
   cursor.execute(sql)
   # 获取所有记录列表
   results = cursor.fetchall()
   for row in results:
      name = row[0]
      id = row[1]
      salary = row[2]
      city = row[3]
       # 打印结果
      print ("fname=%s,id=%s,salary=%d,city=%s" % \
             (name, id, salary, city))
except:
   print ("Error: unable to fetch data")
 
# 关闭数据库连接
db.close()

fname=Mac,id=3,salary=2000,city=hebei
fname=fff,id=4,salary=3000,city=hebei

In [23]:
db = pymysql.connect("localhost","root","123456","dbtest" )
# 使用cursor()方法获取操作游标 
cursor = db.cursor() 
# SQL 查询语句
sql = "SELECT * FROM EMPLOYEE"
try:
   # 执行SQL语句
    cursor.execute(sql)
   # 获取所有记录列表
    results = cursor.fetchall()
    for i in results:
        print (i)
except:
   print ("Error: unable to fetch data") 
# 关闭数据库连接
db.close()

('Mac', 3, 2000, 'hebei')
('fff', 4, 3000, 'hebei')

# because of the data transmitted through the dataframe form,it is better through sqlachemery

In [ ]:
engine=create_engine('mysql+mysqldb://root:123456@localhost:3306/7law?charset=utf8',echo=True)
sql=pd.read_sql('law',engine,chunksize=10000)

In [35]:
from sqlalchemy import create_engine
import pandas as pd
engine=create_engine('mysql+pymysql://root:123456@localhost:3306/dbtest?charset=utf8',echo=True)
sql=pd.read_sql('EMPLOYEE',engine,chunksize=10000)
for i in sql:#the sql is multip
    print(i) #the i is df for python
    
    spark_df = sqlContext.createDataFrame (i)#,schema=['a','b','c','d']
# df for spark
    print(type(spark_df))
    spark_df.registerTempTable('employee')
    try:
        sqlContext.sql('insert into myhive.test02 select * from employee' )
    except:
        print('----->Error')

spark_df.write.format("csv").mode("overwrite").insertInto("myhive.test02")

2018-09-04 11:32:21,834 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2018-09-04 11:32:21,836 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,855 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2018-09-04 11:32:21,858 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,871 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8' and `Collation` = 'utf8_bin'
2018-09-04 11:32:21,876 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,885 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2018-09-04 11:32:21,887 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,893 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2018-09-04 11:32:21,905 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,908 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8) COLLATE utf8_bin AS anon_1
2018-09-04 11:32:21,911 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,916 INFO sqlalchemy.engine.base.Engine DESCRIBE `EMPLOYEE`
2018-09-04 11:32:21,920 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,929 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `dbtest`
2018-09-04 11:32:21,934 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,942 INFO sqlalchemy.engine.base.Engine SHOW CREATE TABLE `EMPLOYEE`
2018-09-04 11:32:21,948 INFO sqlalchemy.engine.base.Engine {}
2018-09-04 11:32:21,956 INFO sqlalchemy.engine.base.Engine SELECT `EMPLOYEE`.name, `EMPLOYEE`.id, `EMPLOYEE`.salary, `EMPLOYEE`.city
FROM `EMPLOYEE`
2018-09-04 11:32:21,966 INFO sqlalchemy.engine.base.Engine {}
  name  id  salary   city
0  Mac   3    2000  hebei
1  fff   4    3000  hebei

/home/neo/anaconda3/lib/python3.5/site-packages/pymysql/cursors.py:170: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

<class 'pyspark.sql.dataframe.DataFrame'>

In [53]:
!hdfs dfs -ls /user/hive/warehouse/myhive.db/test02/

Found 9 items
-rw-r--r--   1 neo supergroup         20 2018-09-03 16:00 /user/hive/warehouse/myhive.db/test02/a.txt
-rw-r--r--   1 neo supergroup         21 2018-09-03 16:00 /user/hive/warehouse/myhive.db/test02/b.txt
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 11:31 /user/hive/warehouse/myhive.db/test02/part-00000
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 11:32 /user/hive/warehouse/myhive.db/test02/part-00000_copy_1
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 14:03 /user/hive/warehouse/myhive.db/test02/part-00000_copy_2
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 14:05 /user/hive/warehouse/myhive.db/test02/part-00000_copy_3
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 14:09 /user/hive/warehouse/myhive.db/test02/part-00000_copy_4
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 14:19 /user/hive/warehouse/myhive.db/test02/part-00000_copy_5
-rwxrwxrwx   1 neo supergroup         34 2018-09-04 14:20 /user/hive/warehouse/myhive.db/test02/part-00000_copy_6

In [54]:
#write.saveAsTable("ai.da_aipurchase_dailysale_hive", None, "append", partitionBy='saledate')
#spark_df.write.saveAsTable("myhive.test02", None, "append", None)

In [55]:
#spark_df.write.mode("overwrite").partitionBy("saledate").insertInto("myhive.test02")
spark_df.write.format("csv").mode("overwrite").insertInto("myhive.test02")

In [64]:
dataframe_mysql = sqlContext.read.format("jdbc")\
.options(\
    url="jdbc:mysql://localhost:3306/dbtest", \
         driver="com.mysql.cj.jdbc.Driver", \
         dbtable="EMPLOYEE", \
         user="root", \
         password="123456"\
        ).load()
dataframe_mysql.show()

+----+---+------+-----+
|name| id|salary| city|
+----+---+------+-----+
| Mac|  3|  2000|hebei|
| fff|  4|  3000|hebei|
+----+---+------+-----+

In [6]:
data=sqlContext.sql('select * from myhive.test02')
print(type(data))
data.write.mode("append").format("jdbc").options(
    url="jdbc:mysql://localhost:3306/dbtest",
    user='root',
    password='123456',
    dbtable="test55",
    #batchsize="1000",
).save()

<class 'pyspark.sql.dataframe.DataFrame'>

# transmited by part

In [1]:
dataframe_mysql = sqlContext.read.format("jdbc")\
.options(\
    url="jdbc:mysql://localhost:3306/dbtest", \
         driver="com.mysql.cj.jdbc.Driver", \
         dbtable="EMPLOYEE", \
         user="root", \
         password="123456"\
        ).load()
dataframe_mysql.show()

+----+---+------+--------+
|name| id|salary|    city|
+----+---+------+--------+
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
|name|  1|  1000| beijing|
|user|  2|  5000|shanghai|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
| Mac|  3|  2000|   hebei|
| fff|  4|  3000|   hebei|
+----+---+------+--------+

In [7]:
dataframe_mysql.write.saveAsTable("myhive.test06", 'csv', "append", partitionBy=['id','city'])

In [9]:
#dataframe_mysql.write.saveAsTable("myhive.test07", 'csv', "append", partitionBy=['id','city'])

In [58]:
data=sqlContext.sql('select * from myhive.test02')

In [60]:
data['name'][(data['id']==4)&(data['city']=='hebei')]='hhh'

TypeError: 'Column' object does not support item assignment

In [36]:
data_pd=data.toPandas()

In [37]:
data_pd

    name  id  salary      city
0   name   1    1000   beijing
1   user   2    5000  shanghai
2    Mac   3    2000     hebei
3    fff   4    3000     hebei
4    Mac   3    2000     hebei
5    fff   4    3000     hebei
6    Mac   3    2000     hebei
7    fff   4    3000     hebei
8    Mac   3    2000     hebei
9    fff   4    3000     hebei
10   Mac   3    2000     hebei
11   fff   4    3000     hebei
12   Mac   3    2000     hebei
13   fff   4    3000     hebei
14   Mac   3    2000     hebei
15   fff   4    3000     hebei
16   Mac   3    2000     hebei
17   fff   4    3000     hebei

In [55]:
data_pd=data_pd.copy()
data_pd['name'][(data_pd['id']==4)&(data_pd['city']=='hebei')]='hhh'

/home/neo/anaconda3/lib/python3.5/site-packages/ipykernel/__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app

In [56]:
data_pd[['name']]

    name
0   name
1   user
2    Mac
3    hhh
4    Mac
5    hhh
6    Mac
7    hhh
8    Mac
9    hhh
10   Mac
11   hhh
12   Mac
13   hhh
14   Mac
15   hhh
16   Mac
17   hhh